/* automatically generated by rust-bindgen 0.72.0 */

pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub type u8_ = ::std::os::raw::c_uchar;
pub type u32_ = ::std::os::raw::c_uint;
pub type u64_ = ::std::os::raw::c_ulonglong;
pub const ravg_consts_RAVG_VAL_BITS: ravg_consts = 44;
pub const ravg_consts_RAVG_FRAC_BITS: ravg_consts = 20;
pub type ravg_consts = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ravg_data {
    pub val: u64_,
    pub val_at: u64_,
    pub old: u64_,
    pub cur: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ravg_data"][::std::mem::size_of::<ravg_data>() - 32usize];
    ["Alignment of ravg_data"][::std::mem::align_of::<ravg_data>() - 8usize];
    ["Offset of field: ravg_data::val"][::std::mem::offset_of!(ravg_data, val) - 0usize];
    ["Offset of field: ravg_data::val_at"][::std::mem::offset_of!(ravg_data, val_at) - 8usize];
    ["Offset of field: ravg_data::old"][::std::mem::offset_of!(ravg_data, old) - 16usize];
    ["Offset of field: ravg_data::cur"][::std::mem::offset_of!(ravg_data, cur) - 24usize];
};
pub const consts_MAX_CPUS: consts = 512;
pub const consts_MAX_DOMS: consts = 64;
pub const consts_MAX_NUMA_NODES: consts = 64;
pub const consts_CACHELINE_SIZE: consts = 64;
pub const consts_NO_DOM_FOUND: consts = 65;
pub const consts_LB_DEFAULT_WEIGHT: consts = 100;
pub const consts_LB_MIN_WEIGHT: consts = 1;
pub const consts_LB_MAX_WEIGHT: consts = 10000;
pub const consts_LB_LOAD_BUCKETS: consts = 100;
pub const consts_LB_WEIGHT_PER_BUCKET: consts = 100;
pub const consts_MSEC_PER_SEC: consts = 1000;
pub const consts_USEC_PER_MSEC: consts = 1000;
pub const consts_NSEC_PER_USEC: consts = 1000;
pub const consts_NSEC_PER_MSEC: consts = 1000000;
pub const consts_USEC_PER_SEC: consts = 1000000;
pub const consts_NSEC_PER_SEC: consts = 1000000000;
pub const consts_DL_RUNTIME_SCALE: consts = 2;
pub const consts_DL_MAX_LATENCY_NS: consts = 50000000;
pub const consts_DL_FREQ_FT_MAX: consts = 100000;
pub const consts_DL_MAX_LAT_PRIO: consts = 39;
pub const consts_MAX_DOM_ACTIVE_TPTRS: consts = 1024;
pub const consts_STATIC_ALLOC_PAGES_GRANULARITY: consts = 1;
pub type consts = ::std::os::raw::c_uint;
pub const stat_idx_RUSTY_STAT_WAKE_SYNC: stat_idx = 0;
pub const stat_idx_RUSTY_STAT_SYNC_PREV_IDLE: stat_idx = 1;
pub const stat_idx_RUSTY_STAT_PREV_IDLE: stat_idx = 2;
pub const stat_idx_RUSTY_STAT_GREEDY_IDLE: stat_idx = 3;
pub const stat_idx_RUSTY_STAT_PINNED: stat_idx = 4;
pub const stat_idx_RUSTY_STAT_DIRECT_DISPATCH: stat_idx = 5;
pub const stat_idx_RUSTY_STAT_DIRECT_GREEDY: stat_idx = 6;
pub const stat_idx_RUSTY_STAT_DIRECT_GREEDY_FAR: stat_idx = 7;
pub const stat_idx_RUSTY_STAT_DSQ_DISPATCH: stat_idx = 8;
pub const stat_idx_RUSTY_STAT_GREEDY_LOCAL: stat_idx = 9;
pub const stat_idx_RUSTY_STAT_GREEDY_XNUMA: stat_idx = 10;
pub const stat_idx_RUSTY_STAT_REPATRIATE: stat_idx = 11;
pub const stat_idx_RUSTY_STAT_KICK_GREEDY: stat_idx = 12;
pub const stat_idx_RUSTY_STAT_LOAD_BALANCE: stat_idx = 13;
pub const stat_idx_RUSTY_STAT_TASK_GET_ERR: stat_idx = 14;
pub const stat_idx_RUSTY_STAT_DL_CLAMP: stat_idx = 15;
pub const stat_idx_RUSTY_STAT_DL_PRESET: stat_idx = 16;
pub const stat_idx_RUSTY_NR_STATS: stat_idx = 17;
pub type stat_idx = ::std::os::raw::c_uint;
